//카프라스
const defensive = [153, 230, 307, 307, 713, 714, 1098, 1194, 1234, 1274, 1272, 1312, 1352, 1392, 1432, 1472, 1512, 1552, 1592, 1632];
const mainWeapon = [297, 389, 481, 573, 905, 1020, 1135, 1250, 1365, 1480, 1522, 1637, 1752, 1867, 1982, 2097, 2212, 2327, 2442, 2557];
const arousalWeapon = [345, 451, 556, 662, 1044, 1176, 1308, 1440, 1573, 1705, 1752, 1884, 2016, 2148, 2280, 2412, 2544, 2672, 2808, 2940];

//채널추천
const channels = ["세렌디아1", "세렌디아2", "세렌디아3", "발렌시아1", "발렌시아2", "발렌시아3", "발레노스1", "발레노스2", "발레노스3", "칼페온1", "칼페온2", "칼페온3", "카마실비아1", "카마실비아2", "카마실비아3", "메디아1", "메디아2", "메디아3", "하이델1", "하이델2", "하이델3", "플로린1", "플로린2", "플로린3", "에페리아1", "에페리아2", "에페리아3", "케플란1", "케플란2", "케플란3", "플로린1", "플로린2", "플로린3",
]

//공구간
const power = [100, 140, 170, 184, 209, 235, 245, 249, 253, 257, 261, 265, 269, 273, 277, 281, 285, 289, 293, 297, 301, 305, 309, 316, 323, 330, 340];

//방구간
const defense = [203, 211, 218, 226, 233, 241, 248, 256, 263, 271, 278, 286, 293, 301, 308, 315, 322, 329, 335, 341, 347, 353, 359, 365, 371, 377, 383, 389, 395, 401];

//보스
const boss = {
    sun: [
        {
            time: "00 : 15",
            bossName: "가모스"
        },
        {
            time: "02 : 00",
            bossName: "카란다 / 쿠툼"
        },
        {
            time: "11 : 00",
            bossName: "크자카 / 누베르"
        },
        {
            time: "16 : 00",
            bossName: "카란다 / 쿠툼"
        },
        {
            time: "17 : 00",
            bossName: "벨"
        },
        {
            time: "20 : 00",
            bossName: "누베르 / 쿠툼"
        },
        {
            time: "23 : 45",
            bossName: "카란다"
        },
    ],
    mon: [
        {
            time: "02 : 00",
            bossName: "크자카"
        },
        {
            time: "11 : 00",
            bossName: "크자카 / 누베르"
        },
        {
            time: "16 : 00",
            bossName: "크자카 / 쿠툼"
        },
        {
            time: "20 : 00",
            bossName: "카란다 / 누베르"
        },
        {
            time: "23 : 45",
            bossName: "오핀"
        },
    ],
    tue: [
        {
            time: "02 : 00",
            bossName: "크자카"
        },
        {
            time: "11 : 00",
            bossName: "크자카 / 쿠툼"
        },
        {
            time: "16 : 00",
            bossName: "크자카 / 누베르"
        },
        {
            time: "20 : 00",
            bossName: "카란다 / 쿠툼"
        },
        {
            time: "23 : 45",
            bossName: "가모스"
        },
    ],
    wed: [
        {
            time: "02 : 00",
            bossName: "누베르 / 오핀"
        },
        {
            time: "16 : 00",
            bossName: "크자카 / 누베르"
        },
        {
            time: "20 : 00",
            bossName: "카란다 / 크자카"
        },
        {
            time: "23 : 15",
            bossName: "귄트 / 무라카"
        },
    ],
    thu: [
        {
            time: "00 : 15",
            bossName: "벨"
        },
        {
            time: "02 : 00",
            bossName: "쿠툼"
        },
        {
            time: "11 : 00",
            bossName: "크자카 / 누베르"
        },
        {
            time: "16 : 00",
            bossName: "카란다 / 쿠툼"
        },
        {
            time: "20 : 00",
            bossName: "누베르 / 쿠툼"
        },
        {
            time: "23 : 45",
            bossName: "가모스"
        },
    ],
    fri: [
        {
            time: "02 : 00",
            bossName: "카란다"
        },
        {
            time: "11 : 00",
            bossName: "크자카 / 쿠툼"
        },
        {
            time: "16 : 00",
            bossName: "카란다 / 누베르"
        },
        {
            time: "20 : 00",
            bossName: "크자카 / 쿠툼"
        },
        {
            time: "23 : 45",
            bossName: "오핀"
        },
    ],
    sat: [
        {
            time: "02 : 00",
            bossName: "카란다 / 누베르"
        },
        {
            time: "11 : 00",
            bossName: "누베르 / 쿠툼"
        },
        {
            time: "16 : 00",
            bossName: "카란다 / 크자카"
        },
        {
            time: "19 : 00",
            bossName: "귄트 / 무라카"
        },
    ]
}

module.exports = { defensive, mainWeapon, arousalWeapon, channels, power, defense, boss };